[Killed] BlockStatement
src/calculator.js:2:15
 class Calculator {
-    add(a, b) {
-        if (typeof a !== 'number' || typeof b !== 'number') {
-            throw new Error('Оба аргумента должны быть числами');
-        }
-
-        return a + b;
-    }
+    add(a, b) {}
 
     subtract(a, b) {
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator
    add

[Killed] EqualityOperator
src/calculator.js:3:38
 class Calculator {
     add(a, b) {
-        if (typeof a !== 'number' || typeof b !== 'number') {
+        if (typeof a !== 'number' || typeof b === 'number') {
             throw new Error('Оба аргумента должны быть числами');
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator

[Killed] ConditionalExpression
src/calculator.js:3:13
 class Calculator {
     add(a, b) {
-        if (typeof a !== 'number' || typeof b !== 'number') {
+        if (true) {
             throw new Error('Оба аргумента должны быть числами');
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator
    add

[Killed] ArithmeticOperator
src/calculator.js:7:16
             throw new Error('Оба аргумента должны быть числами');
         }
 
-        return a + b;
+        return a - b;
     }
 
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator

[Killed] BlockStatement
src/calculator.js:10:20
         return a + b;
     }
 
-    subtract(a, b) {
-        if (typeof a !== 'number' || typeof b !== 'number') {
-            throw new Error('Оба аргумента должны быть числами');
-        }
-        return a - b;
-    }
+    subtract(a, b) {}
 
     multiply(a, b) {
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator

[Killed] ConditionalExpression
src/calculator.js:11:13
     }
 
     subtract(a, b) {
-        if (typeof a !== 'number' || typeof b !== 'number') {
+        if (false) {
             throw new Error('Оба аргумента должны быть числами');
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator

[Killed] ConditionalExpression
src/calculator.js:11:13
     }
 
     subtract(a, b) {
-        if (typeof a !== 'number' || typeof b !== 'number') {
+        if (false || typeof b !== 'number') {
             throw new Error('Оба аргумента должны быть числами');
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js
  Calculator
    add

[Killed] ArithmeticOperator
src/calculator.js:14:16
         if (typeof a !== 'number' || typeof b !== 'number') {
             throw new Error('Оба аргумента должны быть числами');
         }
-        return a - b;
+        return a + b;
     }
 
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator

[Killed] BlockStatement
src/calculator.js:17:20
         return a - b;
     }
 
-    multiply(a, b) {
-        if (typeof a !== 'number' || typeof b !== 'number') {
-            throw new Error('Оба аргумента должны быть числами');
-        }
-        return a * b;
-    }
+    multiply(a, b) {}
 
     divide(a, b) {
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator
    add

[Killed] EqualityOperator
src/calculator.js:18:38
     }
 
     multiply(a, b) {
-        if (typeof a !== 'number' || typeof b !== 'number') {
+        if (typeof a !== 'number' || typeof b === 'number') {
             throw new Error('Оба аргумента должны быть числами');
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js
  Calculator
    add
      ✓ должен корректно складывать два положительных числа (8 ms)

[Killed] ConditionalExpression
src/calculator.js:18:13
     }
 
     multiply(a, b) {
-        if (typeof a !== 'number' || typeof b !== 'number') {
+        if (false || typeof b !== 'number') {
             throw new Error('Оба аргумента должны быть числами');
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator

[Killed] ArithmeticOperator
src/calculator.js:21:16
         if (typeof a !== 'number' || typeof b !== 'number') {
             throw new Error('Оба аргумента должны быть числами');
         }
-        return a * b;
+        return a / b;
     }
 
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js
  Calculator
    add
      ✓ должен корректно складывать два положительных числа (31 ms)

[Killed] BlockStatement
src/calculator.js:24:18
         return a * b;
     }
 
-    divide(a, b) {
-        if (typeof a !== 'number' || typeof b !== 'number') {
-            throw new Error('Оба аргумента должны быть числами');
-        }
-        if (b === 0) {
-            throw new Error('Деление на ноль невозможно');
-        }
-        return a / b;
-    }
+    divide(a, b) {}
 
     power(base, exponent) {
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js
  Calculator
    add

[Killed] LogicalOperator
src/calculator.js:25:13
     }
 
     divide(a, b) {
-        if (typeof a !== 'number' || typeof b !== 'number') {
+        if (typeof a !== 'number' && typeof b !== 'number') {
             throw new Error('Оба аргумента должны быть числами');
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator

[Killed] EqualityOperator
src/calculator.js:25:13
     }
 
     divide(a, b) {
-        if (typeof a !== 'number' || typeof b !== 'number') {
+        if (typeof a === 'number' || typeof b !== 'number') {
             throw new Error('Оба аргумента должны быть числами');
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator

[Killed] StringLiteral
src/calculator.js:26:29
 
     divide(a, b) {
         if (typeof a !== 'number' || typeof b !== 'number') {
-            throw new Error('Оба аргумента должны быть числами');
+            throw new Error("");
         }
         if (b === 0) {
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator
    add

[Killed] ConditionalExpression
src/calculator.js:28:13
         if (typeof a !== 'number' || typeof b !== 'number') {
             throw new Error('Оба аргумента должны быть числами');
         }
-        if (b === 0) {
+        if (true) {
             throw new Error('Деление на ноль невозможно');
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator
    add

[Killed] ConditionalExpression
src/calculator.js:28:13
         if (typeof a !== 'number' || typeof b !== 'number') {
             throw new Error('Оба аргумента должны быть числами');
         }
-        if (b === 0) {
+        if (false) {
             throw new Error('Деление на ноль невозможно');
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator

[Killed] StringLiteral
src/calculator.js:29:29
             throw new Error('Оба аргумента должны быть числами');
         }
         if (b === 0) {
-            throw new Error('Деление на ноль невозможно');
+            throw new Error("");
         }
         return a / b;
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator
    add

[Killed] BlockStatement
src/calculator.js:34:27
         return a / b;
     }
 
-    power(base, exponent) {
-        if (typeof base !== 'number' || typeof exponent !== 'number') {
-            throw new Error('Оба аргумента должны быть числами');
-        }
-        return Math.pow(base, exponent);
-    }
+    power(base, exponent) {}
 
     factorial(n) {
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator

[Killed] BlockStatement
src/calculator.js:35:71
     }
 
     power(base, exponent) {
-        if (typeof base !== 'number' || typeof exponent !== 'number') {
-            throw new Error('Оба аргумента должны быть числами');
-        }
+        if (typeof base !== 'number' || typeof exponent !== 'number') {}
         return Math.pow(base, exponent);
     }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js
  Calculator
    add
      ✓ должен корректно складывать два положительных числа (11 ms)

[Killed] EqualityOperator
src/calculator.js:35:13
     }
 
     power(base, exponent) {
-        if (typeof base !== 'number' || typeof exponent !== 'number') {
+        if (typeof base === 'number' || typeof exponent !== 'number') {
             throw new Error('Оба аргумента должны быть числами');
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator

[Killed] BlockStatement
src/calculator.js:41:18
         return Math.pow(base, exponent);
     }
 
-    factorial(n) {
-        if (typeof n !== 'number') {
-            throw new Error('Аргумент должен быть числом');
-        }
-        if (n < 0) {
-            throw new Error('Факториал определен только для неотрицательных чисел');
-        }
-        if (!Number.isInteger(n)) {
-            throw new Error('Факториал определен только для целых чисел');
-        }
-
-        if (n === 0 || n === 1) {
-            return 1;
-        }
-
-        let result = 1;
-        for (let i = 2; i <= n; i++) {
-            result *= i;
-        }
-        return result;
-    }
+    factorial(n) {}
 }
 
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator
    add

[Killed] BlockStatement
src/calculator.js:42:36
     }
 
     factorial(n) {
-        if (typeof n !== 'number') {
-            throw new Error('Аргумент должен быть числом');
-        }
+        if (typeof n !== 'number') {}
         if (n < 0) {
             throw new Error('Факториал определен только для неотрицательных чисел');
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator
    add

[Killed] EqualityOperator
src/calculator.js:42:13
     }
 
     factorial(n) {
-        if (typeof n !== 'number') {
+        if (typeof n === 'number') {
             throw new Error('Аргумент должен быть числом');
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator

[Killed] StringLiteral
src/calculator.js:43:29
 
     factorial(n) {
         if (typeof n !== 'number') {
-            throw new Error('Аргумент должен быть числом');
+            throw new Error("");
         }
         if (n < 0) {
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator
    add

[Killed] EqualityOperator
src/calculator.js:45:13
         if (typeof n !== 'number') {
             throw new Error('Аргумент должен быть числом');
         }
-        if (n < 0) {
+        if (n <= 0) {
             throw new Error('Факториал определен только для неотрицательных чисел');
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js
  Calculator
    add
      ✓ должен корректно складывать два положительных числа (12 ms)

[Killed] StringLiteral
src/calculator.js:46:29
             throw new Error('Аргумент должен быть числом');
         }
         if (n < 0) {
-            throw new Error('Факториал определен только для неотрицательных чисел');
+            throw new Error("");
         }
         if (!Number.isInteger(n)) {
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js
  Calculator
    add

[Killed] ConditionalExpression
src/calculator.js:48:13
         if (n < 0) {
             throw new Error('Факториал определен только для неотрицательных чисел');
         }
-        if (!Number.isInteger(n)) {
+        if (true) {
             throw new Error('Факториал определен только для целых чисел');
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator

[Killed] BlockStatement
src/calculator.js:48:35
         if (n < 0) {
             throw new Error('Факториал определен только для неотрицательных чисел');
         }
-        if (!Number.isInteger(n)) {
-            throw new Error('Факториал определен только для целых чисел');
-        }
+        if (!Number.isInteger(n)) {}
 
         if (n === 0 || n === 1) {
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator

[Killed] ConditionalExpression
src/calculator.js:52:13
             throw new Error('Факториал определен только для целых чисел');
         }
 
-        if (n === 0 || n === 1) {
+        if (true) {
             return 1;
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator
    add

[Killed] EqualityOperator
src/calculator.js:52:24
             throw new Error('Факториал определен только для целых чисел');
         }
 
-        if (n === 0 || n === 1) {
+        if (n === 0 || n !== 1) {
             return 1;
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator
    add

[Killed] EqualityOperator
src/calculator.js:57:25
         }
 
         let result = 1;
-        for (let i = 2; i <= n; i++) {
+        for (let i = 2; i > n; i++) {
             result *= i;
         }
killedBy: All tests
statusReason: > calculator-app@1.0.0 test
> jest


FAIL src/test/calculator.test.js

  Calculator
